{
  "faction_id": "AS",
  "faction_name": "Adepta Sororitas",
  "abilities": [
    {
      "id": "000008466",
      "name": "Acts of Faith",
      "type": "",
      "description": "If your Army Faction is <span class=\"kwb\">ADEPTA</span> <span class=\"kwb\">SORORITAS</span>, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice.<br><br><div class=\"Columns2\"><span class=\"hi_custom\">GAINING MIRACLE DICE</span><br>If your Army Faction is <span class=\"kwb\">ADEPTA</span> <span class=\"kwb\">SORORITAS</span>, you gain 1 Miracle dice:<br><ul><li>At the start of each battle round.</li><li>Each time an <span class=\"kwb\">ADEPTA</span> <span class=\"kwb\">SORORITAS</span> unit from your army is destroyed.</li></ul><br>Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or <a href=\"/wh40k10ed/the-rules/core-rules/#Re-rolls\">re-rolled</a>, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool.<br><br><span class=\"hi_custom\">PERFORMING AN ACT OF FAITH</span><br>Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a <a href=\"/wh40k10ed/the-rules/core-rules/#Charging-with-a-Unit\">Charge roll</a> or <a href=\"/wh40k10ed/the-rules/core-rules/#2.-Battle-shock\">Battle-shock test</a>, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll:<br><ul><li><a href=\"/wh40k10ed/the-rules/core-rules/#Advance-Moves\">Advance roll</a></li><li><a href=\"/wh40k10ed/the-rules/core-rules/#2.-Battle-shock\">Battle-shock test</a></li><li><a href=\"/wh40k10ed/the-rules/core-rules/#Charging-with-a-Unit\">Charge roll</a></li><li>Damage roll</li><li><a href=\"/wh40k10ed/the-rules/core-rules/#1.-Hit-Roll\">Hit roll</a></li><li><a href=\"/wh40k10ed/the-rules/core-rules/#4.-Saving-Throw\">Saving throw</a></li><li><a href=\"/wh40k10ed/the-rules/core-rules/#2.-Wound-Roll\">Wound roll</a></li></ul><br><div class=\"redExample\"><b>Example:</b> <i>Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).</i></div></div>"
    }
  ],
  "note": "Datasheets in separate file. Lore trimmed for context efficiency."
}